src/cf/InformationRegisters/ИсторияКППЮрлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияКППЮрлиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Юрлицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Юрлицо</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияКППЮрлиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Прочитать историю юрлица - функция-обертка для лаконичности вызовов.
// 
// Параметры:
//  Юрлицо - ОпределяемыйТип.Юрлицо - Юрлицо
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица значений
Функция ПрочитатьИсториюЮрлица(Юрлицо) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	История.Период КАК Период,
		|	История.Юрлицо,
		|	История.КПП
		|ИЗ
		|	РегистрСведений.ИсторияКППЮрлиц КАК История
		|ГДЕ
		|	История.Юрлицо = &Юрлицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период"
	);
	Запрос.УстановитьПараметр("Юрлицо", Юрлицо);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Создать набор записей по юрлицу с отбором без чтения - функция-обертка для лаконичности вызовов.
// 
// Параметры:
//  Юрлицо - ОпределяемыйТип.Юрлицо - Юрлицо
// 
// Возвращаемое значение:
//  РегистрСведенийНаборЗаписей - Набор записей
Функция СоздатьНаборИсторииЮрлица(Юрлицо) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Юрлицо.Установить(Юрлицо);
	Возврат Набор;
	
КонецФункции

#КонецОбласти

#КонецЕсли
